Repository: IFGHou/netcat
Catalog: po/*.po
Languages: fr

source: Listening on %s
fr: En attente sur %s

source: Listening on %s (using %d sockets)
fr: En attente sur %s (%d socket en cours d'utilisation)

source: Received packet from %s:%d -> %s:%d (local)
fr: Paquet reçu de %s:%d -> %s:%d (local)

source: Received packet from %s:%d
fr: Paquet reçu de %s:%d

source: %s open
fr: %s est ouvert

source: Couldn't setup listening socket (err=%d)
fr: Impossible de créer le socket en écoute (err=%d)

source: Unwanted connection from %s:%hu (refused)
fr: Connexion indésirable de %s:%hu (refusé)

source: Connection from %s:%hu
fr: Connexion de %s:%hu

source: Error:
fr: Erreur:

source: Warning:
fr: Attention:

source: Notice:
fr: Info:

source: Total received bytes: %s Total sent bytes: %s
fr: Total octets reçus: %s Total octets envoyés: %s

source: Cmd line:
fr: Ligne de commande:

source: GNU netcat %s, a rewrite of the famous networking tool.
fr: GNU netcat %s, une nouvelle implémentation du célèbre outil réseau.

source: Basic usages:
fr: Utilisations basiques:

source: connect to somewhere: %s [options] hostname port [port] ...
fr: connexion à un hôte: %s [options] hostname port [port] ...

source: listen for inbound: %s -l -p port [options] [hostname] [port] ...
fr: attente de connexion: %s -l -p port [options] [hostname] [port] ...

source: tunnel to somewhere: %s -L hostname:port -p port [options]
fr: mode tunnel: %s -L hostname:port -p port [options]

source: Mandatory arguments to long options are mandatory for short options too.
fr: Les arguments qui sont obligatoires pour les instructions longues le sont aussi pour les courtes.

source: Options: -c, --close close connection on EOF from stdin -e, --exec=PROGRAM program to exec after connect -g, --gateway=LIST source-routing hop point[s], up to 8 -G, --pointer=NUM source-routing pointer: 4, 8, 12, ... -h, --help display this help and exit -i, --interval=SECS delay interval for lines sent, ports scanned -l, --listen listen mode, for inbound connects
fr: Options: -c, --close ferme la connexion à l'EOF provenant de stdin -e, --exec=PROGRAM programme à exécuter après la connexion -g, --gateway=LIST source-routing hop point[s], jusqu'à 8 -G, --pointer=NUM source-routing pointer: 4, 8, 12, ... -h, --help affiche ce texte et quitte le programme -i, --interval=SECS intervalle pour les lignes envoyées ou les ports scannés. -l, --listen mode d'écoute pour les connexions entrantes

source: -L, --tunnel=ADDRESS:PORT forward local port to remote address -n, --dont-resolve numeric-only IP addresses, no DNS -o, --output=FILE output hexdump traffic to FILE (implies -x) -p, --local-port=NUM local port number -r, --randomize randomize local and remote ports -s, --source=ADDRESS local source address (ip or hostname)
fr: -L, --tunnel=ADDRESS:PORT ajoute un port à une adresse distante -n, --dont-resolve adresses IP numériques uniquement, pas de résolution DNS -o, --output=FILE écrit la sortie du trafic dans le fichier FILE (implique -x) -p, --local-port=NUM spécifie le port local utilisé -r, --randomize rend aléatoire les ports locaux et distants -s, --source=ADDRESS spécifie l'adresse source (ip ou hostname)

source: -t, --tcp TCP mode (default) -T, --telnet answer using TELNET negotiation
fr: -t, --tcp mode TCP (par défaut) -T, --telnet répond aux négociation TELNET

source: --tcp TCP mode (default) -t, --telnet answer using TELNET negotiation -T same as --telnet (compat)
fr: --tcp mode TCP (par défaut) -t, --telnet répond aux négociations TELNET -T équivalent à --telnet (compat)

source: -u, --udp UDP mode -v, --verbose verbose (use twice to be more verbose) -V, --version output version information and exit -x, --hexdump hexdump incoming and outgoing traffic -w, --wait=SECS timeout for connects and final net reads -z, --zero zero-I/O mode (used for scanning)
fr: -u, --udp mode UDP -v, --verbose verbeux (deux fois pour plus de détails) -V, --version affiche information sur la version et quitte -x, --hexdump affiche dump hexa des données en entrée / sortie -w, --wait=SECS timeout pour les tentatives de connexions -z, --zero mode zéro-E/S (utilisé pour le scan)

source: Remote port number can also be specified as range. Example: '1-1024'
fr: Le port distant peut être spécifié comme intervalle. Exemple: '1-1024'

source: Copyright (C) 2002 - 2003 Giovanni Giacobbi This program comes with NO WARRANTY, to the extent permitted by law. You may redistribute copies of this program under the terms of the GNU General Public License. For more information about these matters, see the file named COPYING. Original idea and design by Avian Research <hobbit@avian.org>, Written by Giovanni Giacobbi <giovanni@giacobbi.net>.
fr: Copyright (C) 2002 - 2003 Giovanni Giacobbi Ce programme est publié SANS GARANTIES, avec les extensions consenties par la loi. Il est possible de redistribuer des copies de ce programme dans les termes établis par la GNU General Public License. Pour plus d'informations à ce sujet voir le fichier COPYING. Conception et idée originale de Avian Research <hobbit@avian.org>, Ecrit par Giovanni Giacobbi <giovanni@giacobbi.net>.

source: Terminated.
fr: Terminé.

source: Exiting.
fr: Quitte.

source: Couldn't execute %s: %s
fr: Impossible d'exécuter %s: %s

source: Cannot specify `-e' option double
fr: Impossible d'utiliser l'option `-e' plusieurs fois

source: Invalid interval time "%s"
fr: Intervalle non valide "%s"

source: You can specify mode flags (`-l' and `-L') only once
fr: Tu peux spécifier le flag pour la sélection du mode (`-l' e `-L') seulement une fois

source: `-L' and `-z' options are incompatible
fr: Les options `-L' et `-z' sont incompatibles

source: Invalid target string for `-L' option
fr: Spécification du tunnel non valide pour le paramètre `-L'

source: Couldn't resolve tunnel target host: %s
fr: Impossible de résoudre la cible du tunnel: %s

source: Invalid tunnel target port: %s
fr: Port du tunnel non valide: %s

source: Invalid local port: %s
fr: Port local spécifié non valide: %s

source: Invalid tunnel connect port: %s
fr: Port specifié pour la connexion du tunnel non valide: %s

source: Couldn't resolve local host: %s
fr: Port local non valide: %s

source: Couldn't resolve tunnel local host: %s
fr: Impossible de résoudre l'hôte de connexion du tunnel: %s

source: Invalid wait-time: %s
fr: Temps d'attente non valide: %s

source: Try `%s --help' for more information.
fr: Taper `%s --help' pour plus d'informations.

source: `-e' and `-z' options are incompatible
fr: Les options `-e' e `-z' sont incompatibles

source: Debugging support not compiled, option `-d' discarded. Using maximum verbosity.
fr: Support pour le debugging non compilé, option `-d' ignorée.

source: Randomization support not compiled, option `-r' discarded.
fr: Support random non compilé, option `-r' ignorée.

source: Failed to open output file: %s
fr: Impossible d'ouvrir le fichier de sortie: %s

source: Couldn't resolve host "%s"
fr: Impossible de résoudre l'hôte "%s"

source: Invalid port specification: %s
fr: Specification de port non valide: %s

source: Listen mode failed: %s
fr: Mode écoute a échoué: %s

source: Passing control to the specified program
fr: Contrôle passé au programme spécifié

source: %s: missing hostname argument
fr: %s: paramètre du nom d'hôte manquant

source: No ports specified for connection
fr: Aucun port spécifié pour la connexion

source: Inverse name lookup failed for `%s'
fr: La résolution inverse pour `%s' a échoué

source: This host's reverse DNS doesn't match! %s -- %s
fr: Le reverse DNS de cet hôte ne correspond pas! %s -- %s

source: Real hostname for %s [%s] is %s
fr: Le vrai nom d'hôte de %s [%s] est %s

source: Host %s isn't authoritative! (direct lookup failed)
fr: L'hôte %s n'est pas authoritative! (le lookup direct a échoué)

source: Host %s isn't authoritative! (direct lookup mismatch)
fr: L'hôte %s n'est pas authoritative! (le lookup direct érroné)

source: %s -> %s BUT %s -> %s
fr: %s -> %s MAIS %s -> %s

source: any address
fr: toutes les adresses
